In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
# Load min-temp and max-temp data from multiple cities
# Turn all of that data into a single data frame with state, city, date, min, and max temp

import glob

all_dfs = [] 

for one_filename in glob.glob('../data/*,*.csv'): 
    print(f'Loading {one_filename}...')

    city, state = (
        one_filename
        .removeprefix('../data/')
        .removesuffix('.csv')
        .split(',')
    )


    one_df = (
        pd
        .read_csv(one_filename,
                  usecols=[0, 1, 2], 
                  names=['date_time',
                         'max_temp',
                         'min_temp'], 
                  header=0) 
        .assign(city=city.replace('+', ' ').title(), 
                state=state.upper()) 
    )

    all_dfs.append(one_df) 

df = pd.concat(all_dfs)

Loading ../data/albany,ny.csv...
Loading ../data/boston,ma.csv...
Loading ../data/chicago,il.csv...
Loading ../data/los+angeles,ca.csv...
Loading ../data/new+york,ny.csv...
Loading ../data/san+francisco,ca.csv...
Loading ../data/springfield,il.csv...
Loading ../data/springfield,ma.csv...

In [3]:
df

               date_time  max_temp  min_temp         city state
0    2018-12-11 00:00:00        -2        -8       Albany    NY
1    2018-12-11 03:00:00        -2        -8       Albany    NY
2    2018-12-11 06:00:00        -2        -8       Albany    NY
3    2018-12-11 09:00:00        -2        -8       Albany    NY
4    2018-12-11 12:00:00        -2        -8       Albany    NY
..                   ...       ...       ...          ...   ...
723  2019-03-11 09:00:00         5        -2  Springfield    MA
724  2019-03-11 12:00:00         5        -2  Springfield    MA
725  2019-03-11 15:00:00         5        -2  Springfield    MA
726  2019-03-11 18:00:00         5        -2  Springfield    MA
727  2019-03-11 21:00:00         5        -2  Springfield    MA

[5824 rows x 5 columns]

In [4]:
# Does this data set reflect the same time period for each city and state?
df.groupby(['state', 'city'])['date_time'].min().sort_values()

state  city
CA     Los Angeles      2018-12-11 00:00:00
       San Francisco    2018-12-11 00:00:00
IL     Chicago          2018-12-11 00:00:00
       Springfield      2018-12-11 00:00:00
MA     Boston           2018-12-11 00:00:00
       Springfield      2018-12-11 00:00:00
NY     Albany           2018-12-11 00:00:00
       New York         2018-12-11 00:00:00
Name: date_time, dtype: object

In [5]:
df.groupby(['state', 'city'])['date_time'].max().sort_values()

state  city
CA     Los Angeles      2019-03-11 21:00:00
       San Francisco    2019-03-11 21:00:00
IL     Chicago          2019-03-11 21:00:00
       Springfield      2019-03-11 21:00:00
MA     Boston           2019-03-11 21:00:00
       Springfield      2019-03-11 21:00:00
NY     Albany           2019-03-11 21:00:00
       New York         2019-03-11 21:00:00
Name: date_time, dtype: object

In [6]:
df.groupby(['state', 'city'])['date_time'].agg(['min', 'max'])

                                     min                  max
state city
CA    Los Angeles    2018-12-11 00:00:00  2019-03-11 21:00:00
      San Francisco  2018-12-11 00:00:00  2019-03-11 21:00:00
IL    Chicago        2018-12-11 00:00:00  2019-03-11 21:00:00
      Springfield    2018-12-11 00:00:00  2019-03-11 21:00:00
MA    Boston         2018-12-11 00:00:00  2019-03-11 21:00:00
      Springfield    2018-12-11 00:00:00  2019-03-11 21:00:00
NY    Albany         2018-12-11 00:00:00  2019-03-11 21:00:00
      New York       2018-12-11 00:00:00  2019-03-11 21:00:00

In [7]:
# What is the lowest min temperature in each city during our time period?
df.groupby(['state', 'city'])['min_temp'].min()

state  city
CA     Los Angeles       4
       San Francisco     3
IL     Chicago         -28
       Springfield     -25
MA     Boston          -14
       Springfield     -20
NY     Albany          -19
       New York        -14
Name: min_temp, dtype: int64

In [8]:
# What is the highest max temperature in each *state* during our time period?
df.groupby('state')['max_temp'].max()

state
CA    23
IL    16
MA    17
NY    15
Name: max_temp, dtype: int64